/*typedef struct _anon0;
typedef struct _anon1;
typedef struct _anon2;
typedef struct _anon3;
typedef struct _anon4;
typedef struct _anon5;
typedef struct _anon6;
typedef struct _anon7;
typedef struct _anon8;
typedef struct _anon9;
typedef struct _anon10;

typedef char*(*type_3)(char*, int);

typedef unsigned int type_0[1024];
typedef unsigned int type_1[4096];
typedef char type_2[4];
typedef unsigned int type_4[27];

struct _anon0
{
	void* texaddr;
	_anon10 texsurface;
};

struct _anon1
{
	unsigned int globalIndex;
	unsigned int bank;
	unsigned int tspparambuffer;
	unsigned int texparambuffer;
	unsigned int texaddr;
	_anon0 texinfo;
	unsigned short count;
	unsigned short dummy;
};

struct _anon2
{
	_anon3* textures;
	unsigned int nbTexture;
};

struct _anon3
{
	void* filename;
	unsigned int attr;
	unsigned int texaddr;
};

struct _anon4
{
	char FileId[4];
	unsigned char FormatVersion;
	unsigned char FormatId;
	unsigned short Pictures;
	unsigned int Gindex;
	unsigned char OrgColorType;
	unsigned char OrgTexType;
	unsigned short ClutChange;
	unsigned int PalNum;
	unsigned int PalData[27];
	unsigned int TotalSize;
	unsigned int ClutSize;
	unsigned int ImageSize;
	unsigned short HeaderSize;
	unsigned short ClutColors;
	unsigned char PictFormat;
	unsigned char MipMapTextures;
	unsigned char ClutType;
	unsigned char ImageType;
	unsigned short ImageWidth;
	unsigned short ImageHeight;
	_anon6 GsTex0;
	_anon9 GsTex1;
	unsigned int GsRegs;
	unsigned int GsTexClut;
	_anon8 admin;
	unsigned int TpFlag;
	unsigned int ClampFlag;
};

struct _anon5
{
	float x;
	float y;
	float z;
	unsigned int col;
};

struct _anon6
{
	struct
	{
		unsigned long TBP0 : 14;
		unsigned long TBW : 6;
		unsigned long PSM : 6;
		unsigned long TW : 4;
		unsigned long TH : 4;
		unsigned long TCC : 1;
		unsigned long TFX : 2;
		unsigned long CBP : 14;
		unsigned long CPSM : 4;
		unsigned long CSM : 1;
		unsigned long CSA : 5;
		unsigned long CLD : 3;
	};
};

struct _anon7
{
	float x;
	float y;
	float z;
	float u;
	float v;
	unsigned int col;
};

struct _anon8
{
	unsigned int gindex;
	unsigned int size;
	unsigned int count;
	void* addr;
	void* before;
	void* after;
};

struct _anon9
{
	struct
	{
		unsigned long LCM : 1;
		unsigned long pad01 : 1;
		unsigned long MXL : 3;
		unsigned long MMAG : 1;
		unsigned long MMIN : 3;
		unsigned long MTBA : 1;
		unsigned long pad10 : 9;
		unsigned long L : 2;
		unsigned long pad21 : 11;
		unsigned long K : 12;
		unsigned long pad44 : 20;
	};
};

struct _anon10
{
	unsigned int Type;
	unsigned int BitDepth;
	unsigned int PixelFormat;
	unsigned int nWidth;
	unsigned int nHeight;
	unsigned int TextureSize;
	unsigned int fSurfaceFlags;
	unsigned int* pSurface;
	unsigned int* pVirtual;
	unsigned int* pPhysical;
};*/

typedef struct TIM2_PICTUREHEADER /* @anon4 */ {
    // total size: 0xD0
    signed char FileId[4]; // offset 0x0, size 0x4
    unsigned char FormatVersion; // offset 0x4, size 0x1
    unsigned char FormatId; // offset 0x5, size 0x1
    unsigned short Pictures; // offset 0x6, size 0x2
    unsigned int Gindex; // offset 0x8, size 0x4
    unsigned char OrgColorType; // offset 0xC, size 0x1
    unsigned char OrgTexType; // offset 0xD, size 0x1
    unsigned short ClutChange; // offset 0xE, size 0x2
    unsigned int PalNum; // offset 0x10, size 0x4
    unsigned int PalData[27]; // offset 0x14, size 0x6C
    unsigned int TotalSize; // offset 0x80, size 0x4
    unsigned int ClutSize; // offset 0x84, size 0x4
    unsigned int ImageSize; // offset 0x88, size 0x4
    unsigned short HeaderSize; // offset 0x8C, size 0x2
    unsigned short ClutColors; // offset 0x8E, size 0x2
    unsigned char PictFormat; // offset 0x90, size 0x1
    unsigned char MipMapTextures; // offset 0x91, size 0x1
    unsigned char ClutType; // offset 0x92, size 0x1
    unsigned char ImageType; // offset 0x93, size 0x1
    unsigned short ImageWidth; // offset 0x94, size 0x2
    unsigned short ImageHeight; // offset 0x96, size 0x2
    struct /* @anon6 */ {
        // total size: 0x8
        unsigned long TBP0 : 14; // offset 0x0, size 0x4
        unsigned long TBW : 6; // offset 0x0, size 0x4
        unsigned long PSM : 6; // offset 0x0, size 0x4
        unsigned long TW : 4; // offset 0x0, size 0x4
        unsigned long TH : 4; // offset 0x0, size 0x4
        unsigned long TCC : 1; // offset 0x0, size 0x4
        unsigned long TFX : 2; // offset 0x0, size 0x4
        unsigned long CBP : 14; // offset 0x0, size 0x4
        unsigned long CPSM : 4; // offset 0x0, size 0x4
        unsigned long CSM : 1; // offset 0x0, size 0x4
        unsigned long CSA : 5; // offset 0x0, size 0x4
        unsigned long CLD : 3; // offset 0x0, size 0x4
    } GsTex0; // offset 0x98, size 0x8
    struct /* @anon9 */ {
        // total size: 0x8
        unsigned long LCM : 1; // offset 0x0, size 0x4
        unsigned long pad01 : 1; // offset 0x0, size 0x4
        unsigned long MXL : 3; // offset 0x0, size 0x4
        unsigned long MMAG : 1; // offset 0x0, size 0x4
        unsigned long MMIN : 3; // offset 0x0, size 0x4
        unsigned long MTBA : 1; // offset 0x0, size 0x4
        unsigned long pad10 : 9; // offset 0x0, size 0x4
        unsigned long L : 2; // offset 0x0, size 0x4
        unsigned long pad21 : 11; // offset 0x0, size 0x4
        unsigned long K : 12; // offset 0x0, size 0x4
        unsigned long pad44 : 20; // offset 0x0, size 0x4
    } GsTex1; // offset 0xA0, size 0x8
    unsigned int GsRegs; // offset 0xA8, size 0x4
    unsigned int GsTexClut; // offset 0xAC, size 0x4
    struct /* @anon8 */ {
        // total size: 0x18
        unsigned int gindex; // offset 0x0, size 0x4
        unsigned int size; // offset 0x4, size 0x4
        unsigned int count; // offset 0x8, size 0x4
        void * addr; // offset 0xC, size 0x4
        void * before; // offset 0x10, size 0x4
        void * after; // offset 0x14, size 0x4
    } admin; // offset 0xB0, size 0x18
    unsigned int TpFlag; // offset 0xC8, size 0x4
    unsigned int ClampFlag; // offset 0xCC, size 0x4
} TIM2_PICTUREHEADER;

unsigned int Ps2_current_texbreak;
unsigned int Ps2_current_gindex;
unsigned int Ps2_texcontinue_no;
void* Ps2_free_last;
unsigned int Ps2_free_texmemsize;
void* Ps2_now_free;
NJS_TEXMEMLIST Ps2_last_tmlist;
NJS_TEXMEMLIST Ps2_1st_tmlist;
unsigned int Ps2_texmemlist_num;
NJS_TEXMEMLIST* Ps2_tex_info;
TIM2_PICTUREHEADER Ps2_tm_list_last;
TIM2_PICTUREHEADER Ps2_tm_list_1st;
void* Ps2_tex_buff;
unsigned int Ps2_current_texno;
NJS_TEXLIST* Ps2_current_texlist;
NJS_TEXMEMLIST* Ps2_current_texmemlist;
/*char*(*index)(char*, int);
unsigned int Ps2_render_width;
unsigned int palbuf[4096];
unsigned int Ps2_clut[1024];
void* Ps2_render_p;
int Ps2_tex3DEx_count;
_anon7* Ps2_tex3DEx_p;
int Ps2_tex3DEx_trans;
int Ps2_3DEx_count;
_anon5* Ps2_3DEx_p;
int Ps2_3DEx_trans;
unsigned int Ps2_quad_color;
int Ps2_quad_trans;
unsigned int Ps2_current_texno_bk;
_anon2* Ps2_current_texlist_bk;

