#ifndef _EFFSUB3_H_
#define _EFFSUB3_H_

#include "types.h"

typedef struct OR_WORK 
{
    // total size: 0x4E0
    unsigned int flg; // offset 0x0, size 0x4
    unsigned short id; // offset 0x4, size 0x2
    signed char free0[10]; // offset 0x6, size 0xA
    float px; // offset 0x10, size 0x4
    float py; // offset 0x14, size 0x4
    float pz; // offset 0x18, size 0x4
    signed int ax; // offset 0x1C, size 0x4
    signed int ay; // offset 0x20, size 0x4
    signed int az; // offset 0x24, size 0x4
    signed char free1[24]; // offset 0x28, size 0x18
    float pxb; // offset 0x40, size 0x4
    float pyb; // offset 0x44, size 0x4
    float pzb; // offset 0x48, size 0x4
    signed int axb; // offset 0x4C, size 0x4
    signed int ayb; // offset 0x50, size 0x4
    signed int azb; // offset 0x54, size 0x4
    signed char free2[12]; // offset 0x58, size 0xC
    float lox; // offset 0x64, size 0x4
    float loy; // offset 0x68, size 0x4
    float loz; // offset 0x6C, size 0x4
    signed char free3[24]; // offset 0x70, size 0x18
    unsigned int stflg; // offset 0x88, size 0x4
    unsigned int Dummy; // offset 0x8C, size 0x4
    signed char free4[1092]; // offset 0x90, size 0x444
    void (* func)(void *); // offset 0x4D4, size 0x4
    signed int idx; // offset 0x4D8, size 0x4
    signed int Dummy2; // offset 0x4DC, size 0x4
} OR_WORK;

/*typedef struct npobj;
typedef struct NJS_POINT3;
typedef struct O_WRK;
typedef struct _anon2;
typedef struct _anon3;
typedef struct _anon4;
typedef struct _anon5;
typedef struct _anon6;
typedef struct _anon7;
typedef struct _anon8;
typedef struct _anon9;
typedef struct _anon10;
typedef struct _anon11;
typedef struct _anon12;
typedef struct _anon13;
typedef struct _anon14;
typedef struct _anon15;
typedef struct _anon16;
typedef struct _anon17;
typedef struct _anon18;
typedef struct _anon19;
typedef struct _anon20;
typedef struct _anon21;
typedef struct _anon22;
typedef struct _anon23;
typedef struct OR_WORK;
typedef struct _anon25;
typedef struct BH_PWORK;
typedef struct _anon26;
typedef struct _anon27;
typedef struct _anon28;
typedef struct _anon29;
typedef struct _anon30;
typedef struct _anon31;
typedef struct _anon32;
typedef struct _anon33;
typedef struct _anon34;
typedef struct _anon35;
